#1. Написати програму, яка розв’язує квадратне рівняння (ax^2 + bx + c = 0), де
#коефіцієнти (a), (b), (c) вводить користувач. Перевірити випадок
#дискримінанта (D < 0).
import math
a = float(input("Введіть коефіціент а:"))
b = float(input("Введіть коефіціент b:"))
c = float(input("Введіть коефіціент c:"))
D = b**2 - 4*a*c
if D>0 or D == 0:
    x1 = (-b + math.sqrt(D))/(2*a)
    x2 = (-b - math.sqrt(D))/(2*a)
    print("Корені рівняння ax^2 +bx + c = 0 : \nx1 = ", x1,"\nx2 = ", x2)
else:
    print("Рівняння не має коренів")
